In [1]:
# 문제 1: 가로 70cm, 높이 144cm의 삼각형이 있을 때, 빗변의 길이를 구하라

In [4]:
a = 70
b = 144

In [7]:
ans = (a**2 + b**2)**(1/2)

In [10]:
print('빗변의 길이: ', ans)

빗변의 길이:  160.11246047700348

In [11]:
# 문제 2: a = 55.994이고, b = 75일 때, a를 일의 자릿수까지 반올림한 숫자와, b의 절댓값 중 큰 것을 구하라

In [12]:
a = 55.994
b = 75

In [13]:
a = round(a)

In [14]:
a

56

In [16]:
print('a=56 와 b=75 중 더 큰 숫자는', b , '입니다.' )

a=56 와 b=75 중 더 큰 숫자는 75 입니다.

In [19]:
# [문제 3~7] 은 주어진 lorem의 값을 이용한다 (자릿수는 1부터 세도록 한다)

In [18]:
lorem = '''There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don't look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn't anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.'''

In [ ]:
# 문제 3: lorem의 400번째 자리 글자를 구하라

In [37]:
print('문제 3의 답은',lorem[400], '입니다.')

문제 3의 답은 r 입니다.

In [30]:
# 문제 4: lorem의 뒤에서 3번째부터 뒤에서 99번째까지의 글자를 구하라

In [38]:
print('문제 4의 답:',lorem[-3:99:-1])

문제 4의 답: te sdrow citsiretcarahc-non ro ,ruomuh detcejni ,noititeper morf eerf syawla erofereht si muspI meroL detareneg ehT .elbanosaer skool hcihw muspI meroL etareneg ot ,serutcurts ecnetnes ledom fo lufdnah a htiw denibmoc ,sdrow nitaL 002 revo fo yranoitcid a sesu tI .tenretnI eht no rotareneg eurt tsrif eht siht gnikam ,yrassecen sa sknuhc denifederp taeper ot dnet tenretnI eht no srotareneg muspI meroL eht llA .txet fo elddim eht ni neddih gnissarrabme gnihtyna t'nsi ereht erus eb ot deen uoy ,muspI meroL fo egassap a esu ot gniog era uoy fI .elbaveileb ylthgils neve kool t'nod hcihw sdrow desimodnar ro ,ruomuh detcejni yb ,mrof emos ni noita

In [32]:
# 문제 5: lorem의 글자 중 27번째 글자를 대문자로 바꾸어라

In [39]:
print('문제 5의 답:',lorem[27].upper())

문제 5의 답: F

In [40]:
# 문제 6: lorem의 띄어쓰기를 제거해 lorem2 변수로 저장하라

In [42]:
lorem2=lorem.replace(' ','')

In [43]:
print('문제 6의 답:',lorem2)

문제 6의 답: TherearemanyvariationsofpassagesofLoremIpsumavailable,butthemajorityhavesufferedalterationinsomeform,byinjectedhumour,orrandomisedwordswhichdon'tlookevenslightlybelievable.IfyouaregoingtouseapassageofLoremIpsum,youneedtobesurethereisn'tanythingembarrassinghiddeninthemiddleoftext.AlltheLoremIpsumgeneratorsontheInternettendtorepeatpredefinedchunksasnecessary,makingthisthefirsttruegeneratorontheInternet.Itusesadictionaryofover200Latinwords,combinedwithahandfulofmodelsentencestructures,togenerateLoremIpsumwhichlooksreasonable.ThegeneratedLoremIpsumisthereforealwaysfreefromrepetition,injectedhumour,ornon-characteristicwordsetc.

In [44]:
# 문제 7: lorem의 값을 -(하이픈)을 기준으로 나누어라

In [46]:
print('문제 7의 답:',lorem.split('-'))

문제 7의 답: ["There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don't look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn't anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non", 'characteristic words etc.']

In [47]:
# 문제 8: 100 < x < 806 범위 안에서, x가 홀수일 때 x의 합을 구하라

In [58]:
for i in range(101,806):
    if i % 2 == 1:
        i += i

In [60]:
print('문제 8의 답:',i)

문제 8의 답: 1610

In [61]:
# [문제 9] 는 주어진 lorem2의 값을 이용한다

In [63]:
lorem2 = '''Contrary to popular belief, Lorem Ipsum is not simply random text. 
It has roots in a piece of classical Latin literature from 45 BC, 
making it over 2000 years old. Richard McClintock, a Latin 
professor at Hampden-Sydney College in Virginia, looked up one of 
the more obscure Latin words, consectetur, from a Lorem Ipsum 
passage, and going through the cites of the word in classical 
literature, discovered the undoubtable source. Lorem Ipsum 
omes from sections 1.10.32 and 1.10.33 of "de Finibus Bonorum 
et Malorum" (The Extremes of Good and Evil) by Cicero, written in 45 BC. 
This book is a treatise on the theory of ethics, very popular during 
the Renaissance. The first line of Lorem Ipsum, "Lorem ipsum dolor sit 
amet..", comes from a line in section 1.10.32.'''

In [64]:
# 문제 9: lorem2를 짝수 줄만 출력하라

In [66]:
print(lorem2)

Contrary to popular belief, Lorem Ipsum is not simply random text.
It has roots in a piece of classical Latin literature from 45 BC,
making it over 2000 years old. Richard McClintock, a Latin
professor at Hampden-Sydney College in Virginia, looked up one of
the more obscure Latin words, consectetur, from a Lorem Ipsum
passage, and going through the cites of the word in classical
literature, discovered the undoubtable source. Lorem Ipsum
omes from sections 1.10.32 and 1.10.33 of "de Finibus Bonorum
et Malorum" (The Extremes of Good and Evil) by Cicero, written in 45 BC.
This book is a treatise on the theory of ethics, very popular during
the Renaissance. The first line of Lorem Ipsum, "Lorem ipsum dolor sit
amet..", comes from a line in section 1.10.32.

In [69]:
s = lorem2.split(". ")

In [80]:
s

['Contrary to popular belief, Lorem Ipsum is not simply random text',
 '\nIt has roots in a piece of classical Latin literature from 45 BC, \nmaking it over 2000 years old',
 'Richard McClintock, a Latin \nprofessor at Hampden-Sydney College in Virginia, looked up one of \nthe more obscure Latin words, consectetur, from a Lorem Ipsum \npassage, and going through the cites of the word in classical \nliterature, discovered the undoubtable source',
 'Lorem Ipsum \nomes from sections 1.10.32 and 1.10.33 of "de Finibus Bonorum \net Malorum" (The Extremes of Good and Evil) by Cicero, written in 45 BC',
 '\nThis book is a treatise on the theory of ethics, very popular during \nthe Renaissance',
 'The first line of Lorem Ipsum, "Lorem ipsum dolor sit \namet..", comes from a line in section 1.10.32.']

In [83]:
list1 = [s[0],s[2],s[4]]

In [84]:
print("문제 9의 답:", list1)

문제 9의 답: ['Contrary to popular belief, Lorem Ipsum is not simply random text', 'Richard McClintock, a Latin \nprofessor at Hampden-Sydney College in Virginia, looked up one of \nthe more obscure Latin words, consectetur, from a Lorem Ipsum \npassage, and going through the cites of the word in classical \nliterature, discovered the undoubtable source', '\nThis book is a treatise on the theory of ethics, very popular during \nthe Renaissance']

In [85]:
# [문제 10~11] 은 주어진 pdm의 값을 이용하라

In [96]:
pdm = {"통계사업번호" : "2015140319032",
		"사업명" : "캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)",
		"PDM수직단계" : "summary",
		"PDM목차번호" : "0",
		"PDM목차세부번호" : "1",
		"PDM성과지표" : "개요",
		"연차" : "",
		"내용" : "※대표 수혜자 지표(지표명\/측정 성과): 현재 자조모임 회원 가입 수\/ 총 4,279명"}

In [87]:
# 문제 10: pdm에서 통계사업번호를 20230116으로 변경해 pdm2로 저장하라

In [97]:
pdm['통계사업번호']=20230116

In [94]:
pdm

{'통계사업번호': 20230116,
 '사업명': '캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)',
 'PDM수직단계': 'summary',
 'PDM목차번호': '0',
 'PDM목차세부번호': '1',
 'PDM성과지표': '개요',
 '연차': '',
 '내용': '※대표 수혜자 지표(지표명\\/측정 성과): 현재 자조모임 회원 가입 수\\/ 총 4,279명'}

In [98]:
pdm2 = {'통계사업번호': 20230116,
 '사업명': '캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)',
 'PDM수직단계': 'summary',
 'PDM목차번호': '0',
 'PDM목차세부번호': '1',
 'PDM성과지표': '개요',
 '연차': '',
 '내용': '※대표 수혜자 지표(지표명\\/측정 성과): 현재 자조모임 회원 가입 수\\/ 총 4,279명'}

In [100]:
print('문제 10의 답:',pdm2)

문제 10의 답: {'통계사업번호': 20230116, '사업명': '캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)', 'PDM수직단계': 'summary', 'PDM목차번호': '0', 'PDM목차세부번호': '1', 'PDM성과지표': '개요', '연차': '', '내용': '※대표 수혜자 지표(지표명\\/측정 성과): 현재 자조모임 회원 가입 수\\/ 총 4,279명'}

In [101]:
# 문제 11: pdm의 value를 차례대로 출력하라

In [102]:
pdm = {"통계사업번호" : "2015140319032",
		"사업명" : "캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)",
		"PDM수직단계" : "summary",
		"PDM목차번호" : "0",
		"PDM목차세부번호" : "1",
		"PDM성과지표" : "개요",
		"연차" : "",
		"내용" : "※대표 수혜자 지표(지표명\/측정 성과): 현재 자조모임 회원 가입 수\/ 총 4,279명"}

In [104]:
v = pdm.values()

In [105]:
print('문제 11의 답:',v)

문제 11의 답: dict_values(['2015140319032', '캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)', 'summary', '0', '1', '개요', '', '※대표 수혜자 지표(지표명\\/측정 성과): 현재 자조모임 회원 가입 수\\/ 총 4,279명'])

In [106]:
# [문제 12~13] 은 아래의 gene의 값을 이용하라

In [107]:
gene = 'ACAACTATGCATACTATCGGGAACTATCCT'

In [108]:
# 문제 12: gene에서 A의 개수를 출력하라

In [113]:
print('문제 12의 답:', gene.count('A'))

문제 12의 답: 10

In [114]:
# 문제 13: gene에서 ACTAT라는 패턴의 개수를 확인한다

In [116]:
print('문제 12의 답:', gene.count('ACTAT'))

문제 12의 답: 3

In [117]:
# [문제 14~20] 은아래의 test.csv 파일을 사용하며, [문제 14~16] 의 풀이는 test2.csv 파일로 저장될 수 있게 하라

In [118]:
import pandas as pd

In [135]:
df = pd.read_csv('test.csv')

In [136]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [122]:
# 문제 14: test.csv 파일의 Age의 값에 모두 102를 더해 저장하라

In [137]:
df['Age_n']=df['Age']+102

In [138]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_n
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,136.5
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,149.0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,164.0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,129.0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,124.0
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,NaN
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,141.0
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,140.5
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,NaN
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,NaN

In [134]:
# - 문제 15: test.csv 파일의 Sex를 아래와 같이 분류해 저장하라, 남성 → 0, 여성 → 1

In [140]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [145]:
df['Sex_n']=df['Sex'].replace(['male','female'],['0','1'])

In [146]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_n,Sex_n
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,136.5,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,149.0,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,164.0,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,129.0,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,124.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,NaN,0
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,141.0,1
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,140.5,0
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,NaN,0
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,NaN,0

In [147]:
# 문제 16: test.csv 파일에서 Fare의 평균값을 구한 뒤, 평균 이상인 그룹만 분리해 fare_high column에 저장하라

In [153]:
df['fare_high']=df['Fare']>df['Fare'].mean()

In [154]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_n,Sex_n,fare_high
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,136.5,0,False
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,149.0,1,False
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,164.0,0,False
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,129.0,0,False
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,124.0,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,NaN,0,False
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,141.0,1,True
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,140.5,0,False
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,NaN,0,False
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,NaN,0,False

In [155]:
df.to_csv("test2.csv", index = False)

In [156]:
# 문제 17: Passengerid가 아래와 같은 사람의 이름을 출력하라
# 901, 925, 950, 951, 952, 1026, 1028, 1039, 1040, 1106

In [158]:
df['PassengerId']

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [163]:
target = [901, 925, 950, 951, 952, 1026, 1028, 1039, 1040, 1106]

In [165]:
m = df['PassengerId'].apply(lambda x: x in target)

In [167]:
print('문제 17번 답:')
df[m]

문제 17번 답:

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_n,Sex_n,fare_high
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S,123.0,0,False
33,925,3,"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,1,False
58,950,3,"Davison, Mr. Thomas Henry",male,NaN,1,0,386525,16.1000,NaN,S,NaN,0,False
59,951,1,"Chaudanson, Miss. Victorine",female,36.0,0,0,PC 17608,262.3750,B61,C,138.0,1,True
60,952,3,"Dika, Mr. Mirko",male,17.0,0,0,349232,7.8958,NaN,S,119.0,0,False
134,1026,3,"Dintcheff, Mr. Valtcho",male,43.0,0,0,349226,7.8958,NaN,S,145.0,0,False
136,1028,3,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,128.5,0,False
147,1039,3,"Davies, Mr. Evan",male,22.0,0,0,SC/A4 23568,8.0500,NaN,S,124.0,0,False
148,1040,1,"Crafton, Mr. John Bertram",male,NaN,0,0,113791,26.5500,NaN,S,NaN,0,False
214,1106,3,"Andersson, Miss. Ida Augusta Margareta",female,38.0,4,2,347091,7.7750,NaN,S,140.0,1,False

In [168]:
# 문제 18: SibSp가 0인 그룹과 1 이상인 그룹 사이에 Fare의 차이가 있는지 통계적으로 확인하라

In [172]:
df_0 = df[df['SibSp'] == 0]

In [174]:
df_0['Fare'].describe()

count    282.000000
mean      25.986732
std       48.631799
min        0.000000
25%        7.775000
50%        9.337500
75%       25.935425
max      512.329200
Name: Fare, dtype: float64

In [176]:
df_0up = df[df['SibSp']>=1]

In [178]:
df_0up['Fare'].describe()

count    135.000000
mean      55.765032
std       64.341569
min        6.437500
25%       16.100000
50%       26.000000
75%       65.000000
max      263.000000
Name: Fare, dtype: float64

In [184]:
print('문제 18의 답:\n 확인 결과, 통계적으로 차이가 있다.\n Fare=0인 값들은 Fare>=1인 값들보다 평균값과 표준편차가 작다.')

문제 18의 답:
 확인 결과, 통계적으로 차이가 있다.
 Fare=0인 값들은 Fare>=1인 값들보다 평균값과 표준편차가 작다.

In [181]:
# 문제 19: test.csv 파일에서 숫자 데이터로 이루어진 column과 문자 데이터로 이루어진 column을 서로 분리하는 함수를 작성하라

In [191]:
df['Fare'].dtype

dtype('float64')

In [194]:
df.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_n', 'Sex_n', 'fare_high'],
      dtype='object')

In [196]:
# 문제 20: Age가 짝수인 경우 1, 홀수인 경우 0으로 반환하는 함수를 작성하라

In [210]:
def age(x=df['Age']):
    if x%2==0:
        return df['Age']=1
    elif x%2==1:
        return df['Age']=0

SyntaxError: invalid syntax (4163828311.py, line 3)

In [215]:
if df['Age']%2==0:
    if True:
        df['Age']=1

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().